ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульСборщикДанных/вмс_СерверУправляемыйМодульСборщикДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_СерверУправляемыйМодульСборщикДанных</name>
  <comment>Интерфейс для сборщиков данных операций</comment>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
  </attributes>
  <attributes>
    <name>ДанныеОбработки</name>
  </attributes>
  <attributes>
    <name>ПараметрыМодуля</name>
  </attributes>
  <attributes>
    <name>ДанныеМодуля</name>
  </attributes>
  <attributes>
    <name>ДанныеТранзакции</name>
  </attributes>
  <attributes>
    <name>СостояниеМодуля</name>
  </attributes>
  <attributes>
    <name>СтандартныйМодуль</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСтандартный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульСборщикДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем РК;
Перем МодулиМетодов Экспорт;
Перем ДанныеРеальныхМодулей;

#Область API
Функция ВыполнитьДействие(Действие) Экспорт
	
	Если МодулиМетодов <> Неопределено Тогда
		МодулиМетодов.ВыполнитьДействие.ВыполнитьДействие(Действие);
		Если Действие.Обработано Тогда
			Возврат Действие.Результат;
		КонецЕсли;
	КонецЕсли;
	
	Код = Действие.Код;
	
	Если Код="ИнициализироватьПеременныеМодуляОбработки" Тогда
		
		ДействиеИнициализироватьПеременныеМодуляОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьМодульОбработки" Тогда
		
		ДействиеИнициализироватьМодульОбработки(Действие);
		
	КонецЕсли;
		
КонецФункции

Функция ДействиеИнициализироватьПеременныеМодуляОбработки(Действие)
	
КонецФункции

Функция ДействиеИнициализироватьМодульОбработки(Действие)
	
	ИнициализироватьМодульОбработки(Действие.Параметры);
	
КонецФункции

Функция УстановитьПоля(Поля=Неопределено) Экспорт
	
	Возврат МодулиМетодов.УстановитьПоля.УстановитьПоля(Поля);
	
КонецФункции

Функция УстановитьСвойстваПолейПоУмолчанию() Экспорт
	
	Возврат МодулиМетодов.УстановитьСвойстваПолейПоУмолчанию.УстановитьСвойстваПолейПоУмолчанию();
	
КонецФункции

Функция УстановитьДоступныеПоля() Экспорт
	
	Возврат МодулиМетодов.УстановитьДоступныеПоля.УстановитьДоступныеПоля();
	
КонецФункции

Функция УстановитьДополнительныеПоля() Экспорт
	
	Возврат МодулиМетодов.УстановитьДополнительныеПоля.УстановитьДополнительныеПоля();
	
КонецФункции

Функция ПриЗавершенииИнициализацииПолей() Экспорт
	
	Возврат МодулиМетодов.ПриЗавершенииИнициализацииПолей.ПриЗавершенииИнициализацииПолей();
	
КонецФункции

Функция ИнициализироватьДанные() Экспорт
	
	Возврат МодулиМетодов.ИнициализироватьДанные.ИнициализироватьДанные();
	
КонецФункции

Функция ЕстьИзменениеДанных() Экспорт
	
	Возврат МодулиМетодов.ЕстьИзменениеДанных.ЕстьИзменениеДанных();
	
КонецФункции

Функция ЗаполнитьПринятыеДанныеПолей(ВходящиеДанные) Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьПринятыеДанныеПолей.ЗаполнитьПринятыеДанныеПолей(ВходящиеДанные);
	
КонецФункции

Функция ЗаполнитьВведенныеДанныеПолей(ПринятыеДанныеПолей) Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьВведенныеДанныеПолей.ЗаполнитьВведенныеДанныеПолей(ПринятыеДанныеПолей);
	
КонецФункции

Функция ЗаполнитьЗапланированныеДанныеПолей() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьЗапланированныеДанныеПолей.ЗаполнитьЗапланированныеДанныеПолей();
	
КонецФункции

Функция ЗаполнитьСобранныеДанныеПолей() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьСобранныеДанныеПолей.ЗаполнитьСобранныеДанныеПолей();
	
КонецФункции

Функция ЗаполнитьСобранныеДанныеПолейДополнительно() Экспорт

	Возврат МодулиМетодов.ЗаполнитьСобранныеДанныеПолейДополнительно.ЗаполнитьСобранныеДанныеПолейДополнительно();
	
КонецФункции

Функция ЗаполнитьДанныеПолей() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьДанныеПолей.ЗаполнитьДанныеПолей();
	
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолей() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьОбщиеДанныеПолей.ЗаполнитьОбщиеДанныеПолей();
	
КонецФункции

Функция ЗаполнитьОбщиеДанныеПолейДополнительно() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьОбщиеДанныеПолейДополнительно.ЗаполнитьОбщиеДанныеПолейДополнительно();
	
КонецФункции

Функция ЗаполнитьПредставлениеДанныхПолей() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьПредставлениеДанныхПолей.ЗаполнитьПредставлениеДанныхПолей();
	
КонецФункции

Функция ЗаполнитьТаблицы() Экспорт
	
	Возврат МодулиМетодов.ЗаполнитьТаблицы.ЗаполнитьТаблицы();
	
КонецФункции

Функция СохранениеДанныхСборщика(Сборщик, Отказ) Экспорт
	
	Возврат МодулиМетодов.СохранениеДанныхСборщика.СохранениеДанныхСборщика(Сборщик, Отказ);
	
КонецФункции

Функция СохранитьСостояниеОбработки() Экспорт
	
	МодулиМетодов.СохранитьСостояниеОбработки.СохранитьСостояниеОбработки();
	
КонецФункции

Функция ВосстановитьСостояниеОбработки() Экспорт
	
	Для Каждого ЭлементРеальногоМодуля Из ДанныеРеальныхМодулей Цикл
		РеальныйМодуль = ЭлементРеальногоМодуля.Модуль;
		РеальныйМодуль.Интерфейс = ЭтотОбъект;
		ЗаполнитьЗначенияСвойств(РеальныйМодуль, ЭтотОбъект);
	КонецЦикла;
	
	МодулиМетодов.ВосстановитьСостояниеОбработки.ВосстановитьСостояниеОбработки();
	
КонецФункции

Функция ПроанализироватьЗаполнениеПолейДанных(ИмяДанных=Неопределено) Экспорт
	
	Возврат МодулиМетодов.ПроанализироватьЗаполнениеПолейДанных.ПроанализироватьЗаполнениеПолейДанных(ИмяДанных);
	
КонецФункции

Функция РезультатАнализаЗаполненияПолейДанных(Поля, Данные) Экспорт
	
	Возврат МодулиМетодов.РезультатАнализаЗаполненияПолейДанных.РезультатАнализаЗаполненияПолейДанных(Поля, Данные);
	
КонецФункции

Функция НачатьТранзакциюСборщика() Экспорт
	
	Возврат МодулиМетодов.НачатьТранзакциюСборщика.НачатьТранзакциюСборщика();
	
КонецФункции

Функция ОбновитьДанныеТранзакцииОбработки() Экспорт
	
	Возврат МодулиМетодов.ОбновитьДанныеТранзакцииОбработки.ОбновитьДанныеТранзакцииОбработки();
	
КонецФункции

Функция ОстановитьВводДанных(ПропуститьЭтап=Неопределено) Экспорт
	
	Возврат МодулиМетодов.ОстановитьВводДанных.ОстановитьВводДанных(ПропуститьЭтап);
	
КонецФункции

Функция ОтменитьВводДанных() Экспорт
	
	Возврат МодулиМетодов.ОтменитьВводДанных.ОтменитьВводДанных();
	
КонецФункции

Функция ВозобновитьВводДанных() Экспорт
	
	Возврат МодулиМетодов.ВозобновитьВводДанных.ВозобновитьВводДанных();
	
КонецФункции

Функция ЗафиксироватьТранзакциюСборщика() Экспорт
	
	Возврат МодулиМетодов.ЗафиксироватьТранзакциюСборщика.ЗафиксироватьТранзакциюСборщика();
	
КонецФункции

Функция ПослеЗавершенияТранзакцииВвода() Экспорт
	
	Возврат МодулиМетодов.ПослеЗавершенияТранзакцииВвода.ПослеЗавершенияТранзакцииВвода();
	
КонецФункции

Функция ПослеЗавершенияВвода() Экспорт
	
	Возврат МодулиМетодов.ПослеЗавершенияВвода.ПослеЗавершенияВвода();
	
КонецФункции

Функция ОтменитьТранзакциюСборщика() Экспорт
	
	Возврат МодулиМетодов.ОтменитьТранзакциюСборщика.ОтменитьТранзакциюСборщика();
	
КонецФункции

Функция ЗакончитьТранзакциюСборщика() Экспорт
	
	Возврат МодулиМетодов.ЗакончитьТранзакциюСборщика.ЗакончитьТранзакциюСборщика();
	
КонецФункции

Функция НачатьВводДанных(ВходящиеДанные) Экспорт
	
	Возврат МодулиМетодов.НачатьВводДанных.НачатьВводДанных(ВходящиеДанные);
	
КонецФункции

Функция НачатьВыборСледующегоПоля() Экспорт
	
	Возврат МодулиМетодов.НачатьВыборСледующегоПоля.НачатьВыборСледующегоПоля();
	
КонецФункции

Функция РазобратьВходящиеОбъекты(ВходящиеДанные) Экспорт
	
	Возврат МодулиМетодов.РазобратьВходящиеОбъекты.РазобратьВходящиеОбъекты(ВходящиеДанные);
	
КонецФункции

Функция УстановитьРабочиеСтраницы(Страницы) Экспорт
	
	Возврат МодулиМетодов.УстановитьРабочиеСтраницы.УстановитьРабочиеСтраницы(Страницы);
	
КонецФункции

Функция ВводДоступен() Экспорт
	
	Возврат МодулиМетодов.ВводДоступен.ВводДоступен();
	
КонецФункции

Функция ОчиститьДанныеПолей(Поля=Неопределено, ИмяДанных=Неопределено) Экспорт
	
	Возврат МодулиМетодов.ОчиститьДанныеПолей.ОчиститьДанныеПолей(Поля, ИмяДанных);
	
КонецФункции

Функция ВыполнитьЗавершениеОперации() Экспорт
	
	Возврат МодулиМетодов.ВыполнитьЗавершениеОперации.ВыполнитьЗавершениеОперации();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////
//
//						Библиотека функций+
//

#Область БиблиотекаФункций

Функция ИнициализироватьМодульОбработки(ПараметрыИнициализации) Экспорт
	
	Имя = ПараметрыИнициализации.ИмяСборщика;
	ОсновнойМодульСборщика = ПараметрыИнициализации.ОсновнойМодульСборщика;
	
	ИменаМетодов = 
	"ВыполнитьДействие,
	|УстановитьПоля,
	|УстановитьСвойстваПолейПоУмолчанию,
	|УстановитьДоступныеПоля,
	|УстановитьДополнительныеПоля,
	|ПриЗавершенииИнициализацииПолей,
	|ИнициализироватьДанные,
	|ЕстьИзменениеДанных,
	|НачатьВводДанных,
	|НачатьВыборСледующегоПоля,
	|РазобратьВходящиеОбъекты,
	|УстановитьРабочиеСтраницы,
	|ВводДоступен,
	|НачатьТранзакциюСборщика,
	|ОбновитьДанныеТранзакцииОбработки,
	|ЗафиксироватьТранзакциюСборщика,
	|ПослеЗавершенияТранзакцииВвода,
	|ПослеЗавершенияВвода,
	|ОстановитьВводДанных,
	|ОтменитьВводДанных,
	|ВозобновитьВводДанных,
	|ОтменитьТранзакциюСборщика,
	|ЗакончитьТранзакциюСборщика,
	|СохранениеДанныхСборщика,
	|ЗаполнитьПринятыеДанныеПолей,
	|ЗаполнитьВведенныеДанныеПолей,
	|ЗаполнитьЗапланированныеДанныеПолей,
	|ЗаполнитьСобранныеДанныеПолей,
	|ЗаполнитьСобранныеДанныеПолейДополнительно,
	|ЗаполнитьДанныеПолей,
	|ЗаполнитьОбщиеДанныеПолей,
	|ЗаполнитьОбщиеДанныеПолейДополнительно,
	|ЗаполнитьПредставлениеДанныхПолей,
	|ЗаполнитьТаблицы,
	|ПроанализироватьЗаполнениеПолейДанных,
	|РезультатАнализаЗаполненияПолейДанных,
	|ОчиститьДанныеПолей,
	|СохранитьСостояниеОбработки,
	|ВосстановитьСостояниеОбработки,
	|ВыполнитьЗавершениеОперации";
	МодулиМетодов = Новый Структура(ИменаМетодов);
	
	ДанныеРеальныхМодулей = РК.НоваяТаблицаЗначений("ИмяМодуля, Модуль");
	
	ЭтапыВводаДанных = РК.НоваяТаблицаЗначений("ОписаниеОповещения, Группа, Имя, Пропускать, Данные");
	
	Обработки.вмс_СерверУправляемыйМодульСтандартный.ИнициализироватьДанныеОбработки(ПараметрыМодуля);
	
	ПараметрыМодуля.Вставить("ОсновнойМодульСборщика", ОсновнойМодульСборщика);
	ПараметрыМодуля.Вставить("МодулиМетодов", МодулиМетодов);
	ПараметрыМодуля.Вставить("ДанныеРеальныхМодулей", ДанныеРеальныхМодулей);
	
	ПараметрыМодуля.Вставить("ЭтапыВводаДанных", ЭтапыВводаДанных);
	ПараметрыМодуля.Вставить("ПанельЭлементовВыводаПоУмолчанию", ПараметрыОбработки.ПанельЭлементовВыводаПоУмолчанию);
	ПараметрыМодуля.Вставить("РабочиеСтраницы");
	
	//унифицировать для всех модулей операции
	ПараметрыМодуля.Вставить("ПустойЭлементВывода", ПараметрыОбработки.ПустойЭлементВывода);
	ПараметрыМодуля.Вставить("ПустоеПолеОбработки", ПараметрыОбработки.ПустоеПолеОбработки);
	
	ДанныеТранзакции = ПараметрыМодуля.ДанныеТранзакции;
	ДанныеТранзакции.Вставить("НомерЭтапа", 0);
	
	ДобавитьРеальныйМодуль(ОсновнойМодульСборщика);
	
КонецФункции

Функция ДобавитьРеальныйМодуль(РеальныйМодуль) Экспорт
	
	Если НЕ МодульПодключен(РеальныйМодуль) Тогда
		ИмяМодуля = ПолучитьИмяНовогоМодуля(РеальныйМодуль);
		ДанныеРеальногоМодуля = ДанныеРеальныхМодулей.Добавить();
		ДанныеРеальногоМодуля.ИмяМодуля = ИмяМодуля;
		ДанныеРеальногоМодуля.Модуль = РеальныйМодуль;
	КонецЕсли;
	
	РеальныйМодуль.Интерфейс = ЭтотОбъект;
	ЗаполнитьЗначенияСвойств(РеальныйМодуль, ЭтотОбъект);
	РеальныйМодуль.Инициализировать();
	
КонецФункции

Функция Модуль(ИмяМодуля) Экспорт
	
	ДанныеРеальногоМодуляМассив = ДанныеРеальныхМодулей.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля));
	
	Если ДанныеРеальногоМодуляМассив.Количество() > 0 Тогда
		
		Возврат ДанныеРеальногоМодуляМассив[0].Модуль;
		
	Конецесли;
	
КонецФункции

Функция ИмяМодуля(Модуль) Экспорт
	
	ДанныеРеальногоМодуля = ДанныеРеальногоМодуля(Модуль);
	
	Если ДанныеРеальногоМодуля <> Неопределено Тогда
		
		Возврат ДанныеРеальногоМодуля.ИмяМодуля;
		
	Конецесли;
	
КонецФункции

Функция МодульПодключен(Модуль) Экспорт
	
	Возврат ДанныеРеальногоМодуля(Модуль) <> Неопределено;
	
КонецФункции

Функция ДанныеРеальногоМодуля(Модуль) Экспорт
	
	ДанныеРеальногоМодуляМассив = ДанныеРеальныхМодулей.НайтиСтроки(Новый Структура("Модуль", Модуль));
	
	Если ДанныеРеальногоМодуляМассив.Количество() > 0 Тогда
		
		Возврат ДанныеРеальногоМодуляМассив[0];
		
	Конецесли;
	
КонецФункции

Функция ПолучитьИмяНовогоМодуля(Модуль)
	
	ИмяНовогоМодуля = Модуль.Метаданные().Имя;
	
	Префикс = "вмс_СерверУправляемыйМодуль";
	ДлинаПрефикса = СтрДлина(Префикс);
	
	Если Лев(ИмяНовогоМодуля, ДлинаПрефикса)=Префикс Тогда
		ИмяНовогоМодуля = Прав(ИмяНовогоМодуля, СтрДлина(ИмяНовогоМодуля)-ДлинаПрефикса);
	КонецЕсли;
	
	НомерМодуля = 0;
	Префикс = ИмяНовогоМодуля;
	Пока Истина Цикл
		Суффикс = Формат(НомерМодуля, "ЧГ=0");
		ИмяНовогоМодуля = Префикс + Суффикс;
		Если ДанныеРеальныхМодулей.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяНовогоМодуля)).Количество()=0 Тогда
			Прервать;
		КонецЕсли;
		
		НомерМодуля = НомерМодуля + 1;
	КонецЦикла;
	
	Возврат ИмяНовогоМодуля;
	
КонецФункции

Функция УстановитьРеализациюМетодов(ИменаРеализуемыхМетодовИнтерфейса, МодульРеализацииМетодов) Экспорт
	
	ИменаМетодовМассив = РК.ЗначениеВМассив(ИменаРеализуемыхМетодовИнтерфейса);
	
	Для Каждого ИмяМетода Из ИменаМетодовМассив Цикл
		Если НЕ МодулиМетодов.Свойство(ИмяМетода) Тогда
			ВызватьИсключение "Отсуствует интерфейс для метода """ + ИмяМетода + """";
		КонецЕсли;
		
		МодулиМетодов[ИмяМетода] = МодульРеализацииМетодов;
	КонецЦикла;
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, знач Группа=Неопределено, знач Место=Неопределено, знач Имя=Неопределено) Экспорт
	
	ЭтапыВводаДанных = ПараметрыМодуля.ЭтапыВводаДанных;
	
	Если Место=Неопределено Тогда
		Место = Группа;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Если ОписаниеОбработчика <> Неопределено Тогда
			Если ОписаниеОбработчика.ЭтоПередаточныйОбработчикОповещения Тогда
				ОбработчикОповещенияРеальногоМодуля = ОписаниеОбработчика.ДополнительныеПараметры;
			Иначе
				ОбработчикОповещенияРеальногоМодуля = ОписаниеОбработчика;
			КонецЕсли;
			Имя = ОбработчикОповещенияРеальногоМодуля.ИмяПроцедуры;
		КонецЕсли;
	КонецЕсли;
	
	Отбор = Новый Структура("Имя", Имя);
	Если Место <> Неопределено Тогда
		Отбор.Вставить("Группа", Место);
	КонецЕсли;
	
	СуществующиеЭтапы = ЭтапыВводаДанных.НайтиСтроки(Отбор);
	Если СуществующиеЭтапы.Количество() > 0 Тогда
		//заменим обработчик
		ЭтапВводаДанных = СуществующиеЭтапы[0];
	Иначе
		Если Место <> Неопределено Тогда
			СуществующиеЭтапы = ЭтапыВводаДанных.НайтиСтроки(Новый Структура("Группа", Место));
			Если СуществующиеЭтапы.Количество() > 0 Тогда
				СуществующийЭтап = СуществующиеЭтапы[СуществующиеЭтапы.Количество()-1];
				Индекс = ЭтапыВводаДанных.Индекс(СуществующийЭтап) + 1;
			Иначе
				Индекс = ЭтапыВводаДанных.Количество();
			КонецЕсли;
		Иначе
			Индекс = ЭтапыВводаДанных.Количество();
		КонецЕсли;
		ЭтапВводаДанных = ЭтапыВводаДанных.Вставить(Индекс);
		ЭтапВводаДанных.Группа = Группа;
		ЭтапВводаДанных.Имя = Имя;
		ЭтапВводаДанных.Пропускать = Ложь;
		ЭтапВводаДанных.Данные = Новый Структура;
	КонецЕсли;
	
	ЭтапВводаДанных.ОписаниеОповещения = ОписаниеОбработчика;
	
	Возврат ЭтапВводаДанных;
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, Модуль, ДополнительныеПараметры=Неопределено) Экспорт
	
	ИмяМодуля = ИмяМодуля(Модуль);
	Если ИмяМодуля <> Неопределено Тогда
		//это реальный модуль, доступ к нему осуществляется через передаточный обработчик интерфейса
		ОбработчикОповещенияРеальногоМодуля = вмс_ОбщегоНазначенияКлиентСервер.НовыйОписаниеОповещения(ИмяПроцедуры, Неопределено, ДополнительныеПараметры);
		ОбработчикОповещенияРеальногоМодуля.ИмяМодуля = ИмяМодуля;
		ОписаниеОповещения = вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения("ПередаточныйОбработчикОповещения", ПараметрыОбработки, ЭтотОбъект, ОбработчикОповещенияРеальногоМодуля);
		ОписаниеОповещения.ЭтоПередаточныйОбработчикОповещения = Истина;
	Иначе
		ОписаниеОповещения = вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат ОписаниеОповещения;
	
КонецФункции

Функция ПередаточныйОбработчикОповещения(Результат, знач ОбработчикОповещенияРеальногоМодуля) Экспорт
	
	ОбработчикОповещенияРеальногоМодуля = РК.СкопироватьОбъект(ОбработчикОповещенияРеальногоМодуля);
	ОбработчикОповещенияРеальногоМодуля.Модуль = Модуль(ОбработчикОповещенияРеальногоМодуля.ИмяМодуля);
	вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьОбработкуОповещенияПереопределенный(ОбработчикОповещенияРеальногоМодуля, Результат);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено) Экспорт
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

#КонецОбласти

//
//						Библиотека функций-
//
////////////////////////////////////////////////////////////////////////////////////////////

#КонецОбласти


Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

РК = вмс_РаботаСКоллекциями;

#КонецЕсли
